import React, { memo } from "react";

const Offer = () => {
  return (
    <div>
      <div>
        <h2 className="font-extrabold text-[49px] leading-[59px] text-center py-[65px]">
          Публичная оферта
        </h2>
        <h3 className="font-medium text-[22px] leading-[27px] text-[#5E5E5E] text-center md:px-[190px] pb-[84px]">
          В этом разделе вы найдете текст публичной оферты, которая регулирует
          условия предоставления услуг учебного центра Navigate. Мы обеспечиваем
          прозрачность и понятность всех наших обязательств перед студентами.
          Ознакомьтесь с документом, чтобы получить полное представление о
          правилах, правах и обязанностях обеих сторон.
        </h3>
        <h2 className="font-extrabold text-[49px] leading-[59px] text-center py-[71px] md:px-[70px]">
          ПУБЛИЧНАЯ ОФЕРТА НА ПРЕДОСТАВЛЕНИЕ УСЛУГ по проведению курса изучения
          английского языка.
        </h2>
        <p className="font-light text-[20px] leading-[30px] text-center md:px-[160px]">
          1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ. <br /> Публичная оферта - это предложение
          заключить договор. Сам договор заключается путем безоговорочного
          принятия оферты (ее акцепта). <br /> <br />
          Акцепт Оферты – полное и безоговорочное принятие Оферты путем
          осуществления действий, указанных в п.2.3. Оферты. Акцепт Оферты
          создает Договор. <br />
          <br /> Слушатель/Клиент - любое дееспособное физическое лицо,
          принявшее условия настоящего договора (акцептовавшее настоящую оферту){" "}
          <br />
          <br /> Учебный центр - ЧП “Language Academy” (Лицензия по повышению
          квалификации сотрудников и кадров KMO 0402. O’zbekiston Respublikasi,
          Toshkent sh. Vazirlar Mahkamasi huzuridagi ta’lim sifatini nazorat
          qilish davlat inspeksiyasi). Юридический адрес:
          100047, г. Ташкент, Мирзо-Улугбекский р-н, ул. Массив Карасу-3, 5-16.
          Р/С: 20208000100892744001; В ХАТБ “Давр Банк”; МФО:01072; ИНН:
          305610162; ОКОНХ: 85600; Тел.:99-484-22-24. <br />
          <br /> 2. ОБЩИЕ ПОЛОЖЕНИЯ <br />
          <br />
          2.1. В соответствии со ст.367 Гражданского кодекса Республики
          Узбекистан данный документ является официальным публичным предложением
          (офертой) Частного Предприятия «Language Academy» (далее по тексту –
          Учебный центр) любому дееспособному физическому лицу (далее по тексту
          – Слушатель/Клиент ) заключить этот Договор на определенных в нем
          условиях. В случае если пользователем услуги является
          несовершеннолетнее лицо, Клиентом может являться родитель (попечитель,
          иное физическое лицо, являющееся законным представителем
          несовершеннолетнего). <br />
          <br /> 2.2. Настоящая Оферта является официальным документом и
          продемонстрирована в филиалах учебного центра по адресу: Город
          Ташкент, Мирзо-Улугбек р-н, ул. Буюк Ипак йули 111; а также
          опубликован в глобальной компьютерной сети Internet по
          адресу: www.navigate.uz . <br />
          <br /> 2.3. Полным и безоговорочным Акцептом настоящей Оферты являются
          любые действия по выполнению указанных в данной Оферте условий, в том
          числе оплата услуг; регистрация в качестве Клиента на сайте Учебного
          центра (www.navigate.uz); предоставление клиента своих персональных
          данных Учебному центру (Имя, фамилия, дата рождения, номер телефона);
          подтверждение клиента об ознакомлении условием оферты в персональном
          кабинете клиента на сайте www.navigate.uz; а также иные действия,
          подтверждающие намерения лица пользоваться услугами. <br />
          <br /> 2.4. В соответствии с частью ст. 369 и 370 Гражданского кодекса
          Республики Узбекистан, в случае принятия изложенных ниже условий и
          оплаты соответствующей суммы лицо, производящее Акцепт настоящей
          Оферты, становится Стороной настоящей Оферты, именуемой в дальнейшем
          слушатель/клиент (в соответствии с частью четвертой статьи 370
          Гражданского Кодекса РУз акцепт Оферты равносилен заключению договора
          на условиях, изложенных в Оферте). Учебный центр и слушатель/клиент
          также именуются в настоящей Оферте совместно Стороны, а по отдельности
          – Сторона. <br />
          <br /> 3. ПРЕДМЕТ ДОГОВОРА <br />
          <br />
          3.1. Предметом настоящей Оферты является предоставлением возможности
          Слушателю по обучению английскому языку выбранного после тестирования
          слушателя Учебным Центром, без отрыва от места основной учебы и
          работы. <br />
          <br /> 3.2. Учебный центр оказывает услуги в соответствии с
          действующим прейскурантом, опубликованным на интернет-сайте Учебного
          центра www.navigate.uz, а Слушатель производит оплату за услуги в
          соответствии с условиями настоящей Публичной оферты. <br />
          <br /> 4. ПРАВА И ОБЯЗАННОСТИ СТОРОН. <br />
          <br />
          4.1. Обязанности Учебного центра <br />
          <br /> 4.1.1. Проводить 12 занятий в течении одного месяца.
          <br />
          <br /> 4.1.2. Проводить каждое занятие по 80 минут.
          <br />
          <br /> 4.1.3. Снабжать учебными материалами Слушателя. <br />
          <br />
          4.1.4. Распределять по соответствующим уровням, после проверки знания
          Слушателя.
          <br />
          <br /> 4.2. Права Учебного центра
          <br />
          <br /> 4.2.1. Учебный центр имеет право проводить постоянный
          мониторинг по выполнению обязанностей Слушателя.
          <br />
          <br />
          4.2.2. Учебный центр имеет право ограничить слушателя к доступу к
          занятиям и персональному кабинету в случае несвоевременной оплаты за
          обучение. <br />
          <br />
          4.2.3.При 3х разовом невыполнении домашнего задания, 3х разовом
          пропуске уроков, 3х разовом не сдачи новых слов Учебный центр имеет
          право остановить предоставление услуги слушателю без предупреждения
          Слушателя, и раннее оплаченная сумма не принадлежит возврату и не
          переходит на следующий месяц.
          <br />
          <br /> 4.2.4. Учебный центр имеет право не менять учителя, если
          Слушатель просит об этом. <br />
          <br />
          4.2.5. Учебный центр имеет право остановить предоставление услуги
          Слушателю, который не прошел промежуточный экзамен, а также не
          переводить в другую группу, при отсутствии соответствующих групп,
          оставляя за собой права не возвращать раннюю оплаченную сумму за
          обучение. <br />
          <br />
          4.2.6. Вносить изменения в утвержденное расписание занятий без
          снижения количества предоставляемых образовательных услуг.
          <br />
          <br /> 4.2.7. При пропусках занятий Слушателя не производить
          транзакции оплаченных средств другому лицу.
          <br />
          <br />
          4.2.8. Менять Учителя без предупреждения Слушателя, оставляя за собой
          права не возвращать раннюю оплаченную сумму за обучение, не переносить
          на следующий месяц, не переводить в другие группы.
          <br />
          <br /> 4.3. Обязанности Слушателя <br />
          <br />
          4.3.1. До момента заключения Договора и внесения оплаты ознакомиться с
          содержанием и условиями настоящей оферты, стоимостью услуг Учебного
          центра, размещенными на сайте www.navigate.uz
          <br />
          <br /> 4.3.2. Удовлетворительная подготовка к занятиям. <br />
          <br />
          4.3.3 Лично и добросовестно освоить в полном объеме учебный план по
          Программе.
          <br />
          <br /> 4.3.4. Выполнять задания по подготовке к занятиям по Программе.{" "}
          <br />
          <br />
          4.3.5. Не передавать третьим лицам учебно-методические материалы,
          переданные Учебным центром, и доступ к учебному процессу учебного
          центра.
          <br />
          <br /> 4.3.6. Иметь при себе удостоверение и предъявлять сотрудникам
          здания (территория проведения занятий).
          <br />
          <br /> 4.3.7. Бережно относиться к техническим и иным средствам
          обучения, оборудованиям и инвентарям Учебного центра и здания. <br />
          <br />
          4.3.8. Не пропускать занятия и выполнять домашнее задание вовремя.{" "}
          <br />
          <br />
          4.3.9. Оплачивать за обучение до третьего занятия каждого месяца.{" "}
          <br />
          <br />
          4.3.10. Слушатель обязан находиться только на территории Учебного
          центра (Город Ташкент, Мирзо-Улугбек р-н, ул. Буюк Ипак йули 154 (3-4
          этаж))
          <br />
          <br /> 4.3.11. Слушателю запрещается кричать, шуметь, курить в зале
          ожидания и на территории Учебного центра и Гостиницы.
          <br />
          <br /> 4.3.12. Слушателю запрещается отвлекаться и отвлекать других
          слушателей в течение занятий (телефон, наушники и т. д.)   <br />
          <br />
          4.4. Права Слушателя
          <br />
          <br />
          4.4.1. Обращаться к сотруднику Учебного центра по вопросам касающегося
          Учебного центра и обучения. <br />
          <br />
          4.4.2. Получать полную и достоверную информацию об оценке знаний,
          умений, навыков, а также о критериях этой оценки. <br />
          <br />
          4.4.3. Пользоваться имуществом Учебного центра, необходимых для
          осуществления образовательного процесса, во время занятий,
          предусмотренных расписанием. <br />
          <br />
          4.4.4. Посещать занятия в течение месяца, если выполнены все пункты{" "}
          <br />
          <br />
          4.3. 5. ОБЩИЕ ПОРЯДКИ. <br />
          <br />
          5.1. В случае совпадения дней занятии с праздничными днями, отмечаемые
          в Республике Узбекистан, и в случае ограничения доступа к зданию,
          занятия отменяются и не переносятся в другой день и оплаченная сумма
          не переходит на следующий месяц и не принадлежит возврату.
          <br />
          <br /> 5.2. При не выполнении обязанностей, указанных в пункте № 4.3.
          слушатель отчисляется с Учебного Центра, и слушатель несет
          определенные виды ответственности вплоть до возмещения понесенных
          убытков, и оплаченная сумма не переходит на следующий месяц и не
          принадлежит возврату. <br />
          <br />
          5.3. Учебный центр не несет ответственности за несоответствие
          предоставленной услуги ожиданиям слушателя/клиента и/или за его
          субъективную оценку, такое несоответствие ожиданиям и/ или
          отрицательная субъективная оценка не являются основаниями для возврата
          уплаченных денежных средств. <br />
          <br />
          5.4. Если Слушатель пропускает определенное количество занятий и хочет
          продолжить обучение, то сумма взимается полностью за 12 занятий.{" "}
          <br />
          <br /> 5.5. Если Слушатель решает остановить обучение, то раннее
          оплаченная сумма не переходит на следующий месяц и не подлежит
          возврату не при каких случаях (пропуск, уважительная причина,
          добровольный отказ и т. д.). <br />
          <br />
          5.6. Оплата взимается полностью за 12 занятий, в случае если Слушатель
          не предупредил Учебного центра об уходе в письменном виде до конца
          прошедшего месяца.
          <br />
          <br /> 5.7. Если Слушатель пропускает уроки, ранее оплаченная сумма не
          подлежит возврату. <br />
          <br />
          5.8. В случае провала экзамена и не нахождения соответствующих групп
          Учебным центром, оплаченная сумма не переходит на следующий месяц и не
          подлежит возврату, и Слушатель обязан доучиться в своей группе до
          начало нового месяца.
          <br />
          <br /> 5.9. Если Учебный центр переезжает или временно останавливает
          свою деятельность, то оставшиеся занятия Учебный центр имеет право
          возместить в течении 6 месяцев.
          <br />
          <br /> 5.10. Учебный центр оставляет за собой право остановить
          предоставление услуг клиенту без возврата денежных средств, в случае
          нарушения правил урока, а именно: разжигание межнациональных
          конфликтов, отвлечение других слушателей от темы урока, нецензурные
          высказывания, хамство, оскорбление учителя или других слушателей.
          <br />
          <br />
          5.11. Учебный центр вправе изменить или дополнить настоящие Условия в
          любой момент как с уведомлением Клиента, так и без него. <br />
          <br />
          5.12. Учебный центр освобождается от ответственности за полное или
          частичное неисполнение обязательств, предусмотренных настоящим
          Договором, если это неисполнение явилось следствием обстоятельств
          непреодолимой силы, возникших после заключения Договора, в результате
          событий чрезвычайного характера, которые Стороны не могли ни
          предвидеть, ни предотвратить разумными мерами (форс-мажор).
          <br />
          <br /> 6. ПОРЯДОК И УСЛОВИЯ ОПЛАТЫ. <br />
          <br />
          6.1. Стоимость услуги устанавливается в сумах РУз.
          <br />
          <br /> 6.2. Стоимость услуги определяется в соответствии с
          прейскурантом указанная в приложение №1;
          <br />
          <br /> 6.3. Месячная оплата за обучение должна быть предоставлена до
          третьего занятия каждого месяца. <br />
          <br />
          7. СРОК ДЕЙСТВИЯ И ИЗМЕНЕНИЕ ДОГОВОРА ОФЕРТЫ. <br />
          <br />
          7.1. Договор вступает в силу с момента его заключения (акцепта оферты)
          и действует до выполнения Сторонами своих обязательств. <br />
          <br />
          7.2. Настоящая Публичная оферта заключается в вышеуказанных целях без
          каких – либо ограничений в дате. <br />
          <br />
          7.3. При расторжении договора оферты, акт о расторжении договора не
          формируется и не подписывается сторонами. <br />
          <br />
          7.4. Все споры и разногласия решаются путем переговоров Сторон. <br />
          <br />
          7.5. Все вопросы, не урегулированные настоящей Публичной Офертой,
          решаются в соответствии с действующим законодательством РУз. <br />
          <br />
          8. ПОРЯДОК СДАЧИ И ПРИЕМКИ ОКАЗАННЫХ УСЛУГ.
          <br />
          <br />
          8.1. По завершению услуг, акт об оказанных услугах не формируется и не
          подписывается. Приемка производится без подписания актов. Услуги
          считаются оказанными надлежащим образом и принятыми
          клиентом/слушателем в полном объеме, если в течение десяти календарных
          дней после окончания последнего оплаченного занятия Учебный центр не
          получил от Клиента/слушателя мотивированное письменное возражение по
          качеству оказанных услуг на электронную
          почту navigate.english.academy@gmail.com <br />
          <br />
          9. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ.
          <br />
          <br />
          9.1. В течение трех дней после внесения первой оплаты Клиент/Слушатель
          должен отправить отсканированный документ подтверждающий его/её
          личность (Паспорт, Свидетельство о рождении) Учебному центру по
          электронной почте navigate.english.academy@gmail.com. В этом же
          электронном письме Клиент/Слушатель должен указать свои персональные
          информации (которые ранее были предоставлены в устном порядке при
          регистрации в Учебном центре), а именно: Ф.И.О.; Дата рождения; номер
          телефона. <br />
          <br />
          9.2. Учебный центр не несёт ответственность за содержание и
          достоверность информации, предоставленной Слушателем при регистрации и
          в электронном письме.
          <br />
          <br /> 9.3. Слушатель несёт ответственность за достоверность
          предоставленной информации при регистрации в электронном письме.{" "}
          <br />
          <br />
          9.4. Стороны обязуются немедленно информировать друг друга о
          затруднениях, препятствующих выполнению условий настоящего Договора,
          для своевременного принятия необходимых мер. <br />
          <br />
          9.5. Клиент гарантирует, что все условия настоящего договора
          (публичной оферты) ему понятны, и клиент принимает условия без
          оговорок и в полном объеме. <br />
          <br />
          10. РЕКВЕЗИТЫ УЧЕБНОГО ЦЕНТРА. ЧП “Language Academy” (Лицензия по
          повышению квалификации сотрудников и
          кадров KMO 0402. O’zbekiston Respublikasi, Toshkent sh. Vazirlar Mahkamasi huzuridagi ta’lim sifatini nazorat qilish davlat inspeksiyasi).
          Юридический адрес: 100047, г. Ташкент, Мирзо-Улугбекский р-н, ул.
          Массив Карасу-3, 5-16. Р/С: 20208000100892744001; В ХАТБ “Давр Банк”;
          МФО:01072; ИНН: 305610162; ОКОНХ: 85600; <br />
          Тел.:99-484-22-24
          <br />
          <br />
          Директор: Кучимов А.   <br />
          <br />
          Приложение №1. Наименование Тарифа Количество слушателей в Группе
          Стоимость обучения за каждый урок(в Сумах РУзб). Стоимость обучения за
          один полный месяц (в Сумах РУзб).
        </p>
        <p className="font-light text-[34px] leading-[41px] text-center md:px-[160px] pb-[320px]">
          <br />
          <br />
          General English: <br />
          Кол-во учеников: 13±1 <br />
          Стоимость одного урока: от 56.666 сум.
          <br />
          Стоимость 12 уроков (месяц): от 750.000 сум.
          <br />
          <br />
          IELTS Group
          <br />
          Кол-во учеников: 13±1
          <br />
          Стоимость одного урока: от 57.500 сум.
          <br />
          Стоимость 12 уроков (месяц): от 770.000 сум.
          <br />
          <br />
          Individual
          <br />
          Кол-во учеников: 1<br />
          Стоимость одного урока: от 166.666 сум.
          <br />
          Стоимость 12 уроков (месяц): от 2.000.000 сум.
          <br />
          <br />
          Corporate English
          <br />
          Кол-во учеников: Обсуждается отдельно
          <br />
          Стоимость одного урока: от 66.666 сум.
          <br />
          Стоимость 12 уроков (месяц): от 800.000 сум.
        </p>
      </div>
    </div>
  );
};

export default memo(Offer);
